rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_QUADSPI.h
#define QuadSPI_INT_EN_FRAD1ACC_MASK             (0x4U)
#define QuadSPI_INT_EN_FRAD1ACC_SHIFT            (2U)
#define QuadSPI_INT_EN_FRAD1ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD1ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD1ACC_SHIFT)) & QuadSPI_INT_EN_FRAD1ACC_MASK)

#define QuadSPI_INT_EN_FRAD2ACC_MASK             (0x8U)
#define QuadSPI_INT_EN_FRAD2ACC_SHIFT            (3U)
#define QuadSPI_INT_EN_FRAD2ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD2ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD2ACC_SHIFT)) & QuadSPI_INT_EN_FRAD2ACC_MASK)

#define QuadSPI_INT_EN_FRAD3ACC_MASK             (0x10U)
#define QuadSPI_INT_EN_FRAD3ACC_SHIFT            (4U)
#define QuadSPI_INT_EN_FRAD3ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD3ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD3ACC_SHIFT)) & QuadSPI_INT_EN_FRAD3ACC_MASK)

#define QuadSPI_INT_EN_FRAD4ACC_MASK             (0x20U)
#define QuadSPI_INT_EN_FRAD4ACC_SHIFT            (5U)
#define QuadSPI_INT_EN_FRAD4ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD4ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD4ACC_SHIFT)) & QuadSPI_INT_EN_FRAD4ACC_MASK)

#define QuadSPI_INT_EN_FRAD5ACC_MASK             (0x40U)
#define QuadSPI_INT_EN_FRAD5ACC_SHIFT            (6U)
#define QuadSPI_INT_EN_FRAD5ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD5ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD5ACC_SHIFT)) & QuadSPI_INT_EN_FRAD5ACC_MASK)

#define QuadSPI_INT_EN_FRAD6ACC_MASK             (0x80U)
#define QuadSPI_INT_EN_FRAD6ACC_SHIFT            (7U)
#define QuadSPI_INT_EN_FRAD6ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD6ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD6ACC_SHIFT)) & QuadSPI_INT_EN_FRAD6ACC_MASK)

#define QuadSPI_INT_EN_FRAD7ACC_MASK             (0x100U)
#define QuadSPI_INT_EN_FRAD7ACC_SHIFT            (8U)
#define QuadSPI_INT_EN_FRAD7ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD7ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD7ACC_SHIFT)) & QuadSPI_INT_EN_FRAD7ACC_MASK)

#define QuadSPI_INT_EN_IPS_ERR_MASK              (0x200U)
#define QuadSPI_INT_EN_IPS_ERR_SHIFT             (9U)
#define QuadSPI_INT_EN_IPS_ERR_WIDTH             (1U)
#define QuadSPI_INT_EN_IPS_ERR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_IPS_ERR_SHIFT)) & QuadSPI_INT_EN_IPS_ERR_MASK)

#define QuadSPI_INT_EN_TG0SFAR_MASK              (0x400U)
#define QuadSPI_INT_EN_TG0SFAR_SHIFT             (10U)
#define QuadSPI_INT_EN_TG0SFAR_WIDTH             (1U)
#define QuadSPI_INT_EN_TG0SFAR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_TG0SFAR_SHIFT)) & QuadSPI_INT_EN_TG0SFAR_MASK)

#define QuadSPI_INT_EN_TG1SFAR_MASK              (0x800U)
#define QuadSPI_INT_EN_TG1SFAR_SHIFT             (11U)
#define QuadSPI_INT_EN_TG1SFAR_WIDTH             (1U)
#define QuadSPI_INT_EN_TG1SFAR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_TG1SFAR_SHIFT)) & QuadSPI_INT_EN_TG1SFAR_MASK)

#define QuadSPI_INT_EN_TG0IPCR_MASK              (0x1000U)
#define QuadSPI_INT_EN_TG0IPCR_SHIFT             (12U)
#define QuadSPI_INT_EN_TG0IPCR_WIDTH             (1U)
#define QuadSPI_INT_EN_TG0IPCR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_TG0IPCR_SHIFT)) & QuadSPI_INT_EN_TG0IPCR_MASK)

#define QuadSPI_INT_EN_TG1IPCR_MASK              (0x2000U)
#define QuadSPI_INT_EN_TG1IPCR_SHIFT             (13U)
#define QuadSPI_INT_EN_TG1IPCR_WIDTH             (1U)
#define QuadSPI_INT_EN_TG1IPCR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_TG1IPCR_SHIFT)) & QuadSPI_INT_EN_TG1IPCR_MASK)

#define QuadSPI_INT_EN_TO_ERR_MASK               (0x4000U)
#define QuadSPI_INT_EN_TO_ERR_SHIFT              (14U)
#define QuadSPI_INT_EN_TO_ERR_WIDTH              (1U)
#define QuadSPI_INT_EN_TO_ERR(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_TO_ERR_SHIFT)) & QuadSPI_INT_EN_TO_ERR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group QuadSPI_Register_Masks */

/*!
 * @}
 */ /* end of group QuadSPI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_QuadSPI_H_) */
